Repository: pacoon/guix
Catalog: po/guix/*.po
Languages: vi

source: ~a: patch not found
vi: ~a: không tìm thấy miếng vá

source: could not find bootstrap binary '~a' for system '~a'
vi: không thể tìm thấy phần nhị phân mồi “~a” cho hệ thống “~a”

source: cannot access `~a': ~a~%
vi: không thể truy cập “~a”: ~a~%

source: looking for the latest release of GNU ~a...
vi: tìm bản phát hành mới nhất ~a GNU…

source: ~a: note: using ~a but ~a is available upstream~%
vi: ~a: ghi chú: dùng ~a nhưng ~a thì sẵn có trên thượng nguồn~%

source: ambiguous package specification `~a'~%
vi: đặc tả gói chưa rõ ràng “~a'~%

source: choosing ~a from ~a~%
vi: chọn ~a từ ~a~%

source: ~A: package not found for version ~a~%
vi: ~A: gói không tìm thấy cho phiên bản ~a~%

source: ~A: unknown package~%
vi: ~A: không hiểu gói ~%

source: system locale lacks a definition
vi: miền địa phương hệ thống thiếu một định nghĩa

source: failed to create GC root `~a': ~a~%
vi: gặp lỗi khi tạo gốc GC “~a”: ~a~%

source: -L, --load-path=DIR prepend DIR to the package module search path
vi: -L, --load-path=TMỤC nối thêm vào trước đường dẫn để tìm kiếm mô-đun gói

source: -K, --keep-failed keep build tree of failed builds
vi: -K, --keep-failed giữ lại cây biên dịch của lần biên dịch gặp lỗi

source: -n, --dry-run do not build the derivations
vi: -n, --dry-run không biên dịch dẫn xuất

source: --fallback fall back to building when the substituter fails
vi: --roll-back quay lại dịch khi “substituter” thất bại

source: --no-substitutes build instead of resorting to pre-built substitutes
vi: --no-substitutes biên dịch thay vì nhờ vào phần thay thế được dựng trước

source: --no-build-hook do not attempt to offload builds via the build hook
vi: --no-build-hook không cố biên dịch không tải thông qua móc biên dịch

source: --max-silent-time=SECONDS mark the build as failed after SECONDS of silence
vi: --max-silent-time=GIÂY đánh dấu là việc dịch sẽ là lỗi nếu lâu hơn số GIÂY này

source: --timeout=SECONDS mark the build as failed after SECONDS of activity
vi: --timeout=GIÂY đánh dấu là việc dịch sẽ là lỗi nếu lâu hơn số GIÂY này

source: --verbosity=LEVEL use the given verbosity LEVEL
vi: --verbosity=MỨC dùng mức chi tiết đã cho

source: -c, --cores=N allow the use of up to N CPU cores for the build
vi: -c, --cores=N cho dùng đến N lõi CPU cho công việc biên dịch

source: -M, --max-jobs=N allow at most N build jobs
vi: -M, --max-jobs=N cho phép nhiều nhất là biên dịch N công việc

source: not a number: '~a' option argument: ~a~%
vi: không phải là con số: “~a” tham số tùy chọn: ~a~%

source: Usage: guix build [OPTION]... PACKAGE-OR-DERIVATION... Build the given PACKAGE-OR-DERIVATION and return their output paths.
vi: Cách dùng: guix build [TÙY-CHỌN]… PACKAGE-OR-DERIVATION… Biên dịch PACKAGE-OR-DERIVATION đã cho và trả về đường dẫn kết xuất của chúng.

source: -e, --expression=EXPR build the package or derivation EXPR evaluates to
vi: -e, --expression=BTHỨC biên dịch gói hay tìm nguồn gốc BTHỨC lượng giá cho

source: -S, --source build the packages' source derivations
vi: -S, --source biên dịch nguồn gốc mã nguồn của gói

source: -s, --system=SYSTEM attempt to build for SYSTEM--e.g., "i686-linux"
vi: -s, --system=HỆ-THỐNG cố biên dịch cho HỆ-THỐNG--ví dụ: "i686-linux"

source: --target=TRIPLET cross-build for TRIPLET--e.g., "armel-linux-gnu"
vi: --target=BỘ_BA biên dịch chéo cho BỘ BA--ví dụ: "armel-linux-gnu"

source: --with-source=SOURCE use SOURCE when building the corresponding package
vi: --with-source=MÃ_NGUỒN dùng mã nguồn khi biên dịch gói tương ứng

source: --no-grafts do not graft packages
vi: --no-grafts không gói ghép

source: -d, --derivations return the derivation paths of the given packages
vi: -d, --derivations trả về các đường dẫn nguồn gốc của các gói đã cho

source: -r, --root=FILE make FILE a symlink to the result, and register it as a garbage collector root
vi: -r, --root=TẬP-TIN tạo TẬP-TIN một liên kết mềm đến kết quả, và đăng ký nó như là bộ gom rác gốc

source: --log-file return the log file names for the given derivations
vi: --log-file trả về tên của tập-tin nhật ký cho dẫn xuất đã cho

source: -h, --help display this help and exit
vi: -h, --help hiển thị trợ giúp này rồi thoát

source: -V, --version display version information and exit
vi: -V, --version hiển thị thông tin phiên bản rồi thoát

source: sources do not match any package:~{ ~a~}~%
vi: mã nguồn không khớp bất kỳ gói nào:~{ ~a~}~%

source: ~A: unrecognized option~%
vi: ~A: tùy chọn không được chấp nhận~%

source: no build log for '~a'~%
vi: không có nhật ký dịch cho “~a'~%

source: Usage: guix download [OPTION] URL Download the file at URL, add it to the store, and print its store path and the hash of its contents. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
vi: Cách dùng: guix download [TÙY-CHỌN] URL Tải về tập tin từ URL, thêm nó vào kho chứa, và in đường dẫn và mã băm nội dung của nó. Các định dạng được hỗ trợ: “nix-base32” (mặc định), “base32”, và “base16” (dùng “hex” và “hexadecimal” cũng được).

source: -f, --format=FMT write the hash in the given format
vi: -f, --format=FMT ghi mã băm theo định dạng đã cho

source: unsupported hash format: ~a~%
vi: định dạng băm không được hỗ trợ: ~a~%

source: ~a: failed to parse URI~%
vi: ~a: gặp lỗi khi phân tích URI~%

source: ~a: download failed~%
vi: ~a: gặp lỗi khi tải về~%

source: failed to build the empty profile~%
vi: gặp lỗi khi biên dịch hồ sơ trống rỗng~%

source: switching from generation ~a to ~a~%
vi: chuyển từ thế hệ ~a sang ~a~%

source: nothing to do: already at the empty profile~%
vi: không có gì cần làm: đã là một hồ sơ trống rỗng~%

source: deleting ~a~%
vi: đang xóa ~a~%

source: package `~a' lacks output `~a'~%
vi: gói “~a” thiếu kết xuất “~a'~%

source: ~a: package not found~%
vi: ~a: không tìm thấy gói~%

source: The following environment variable definitions may be needed:~%
vi: Những định nghĩa biến môi trường sau đây là cần thiết:~%

source: Usage: guix package [OPTION]... PACKAGES... Install, remove, or upgrade PACKAGES in a single transaction.
vi: Cách dùng: guix package [TÙY CHỌN]… GÓI… Cài đặt, gỡ bỏ hay cập nhật GÓI trong một giao dịch đơn.

source: -i, --install=PACKAGE install PACKAGE
vi: -i, --install=GÓI cài đặt GÓI

source: -e, --install-from-expression=EXP install the package EXP evaluates to
vi: -e, --install-from-expression=BT cài đặt gói được BT định giá cho

source: -r, --remove=PACKAGE remove PACKAGE
vi: -r, --remove=GÓI gỡ bỏ GÓI

source: -u, --upgrade[=REGEXP] upgrade all the installed packages matching REGEXP
vi: -u, --upgrade[=BTCQ] cập nhật tất cả các gói khớp với BTCQ

source: --roll-back roll back to the previous generation
vi: --roll-back quay lại thế hệ trước

source: --search-paths display needed environment variable definitions
vi: --search-paths hiển thị các định nghĩa biến môi trường cần thiết

source: -l, --list-generations[=PATTERN] list generations matching PATTERN
vi: -l, --list-generations[=MẪU] liệt kê các gói khớp MẪU

source: -d, --delete-generations[=PATTERN] delete generations matching PATTERN
vi: -d, --delete-generations[=MẪU] xóa các bộ tạo khớp MẪU

source: -S, --switch-generation=PATTERN switch to a generation matching PATTERN
vi: -S, --switch-generation=MẪU chuyển sang một thế hệ khớp MẪU

source: -p, --profile=PROFILE use PROFILE instead of the user's default profile
vi: -p, --profile=HỒ_SƠ dùng hồ sơ đưa ra thay cho hồ sơ mặc định

source: --bootstrap use the bootstrap Guile to build the profile
vi: --bootstrap dùng chương trình mồi Guile để biên dịch hồ sơ

source: --verbose produce verbose output
vi: --verbose tạo ra kết xuất chi tiết

source: -s, --search=REGEXP search in synopsis and description using REGEXP
vi: -s, --search=BTCQ tìm trong tóm lược và mô tả sử dụng BIỂU THỨC CHÍNH QUY

source: -I, --list-installed[=REGEXP] list installed packages matching REGEXP
vi: -I, --list-installed[=BIỂU-THỨC-CHÍNH-QUY] kiệt kê các gói khớp BTCQ đã cài đặt

source: -A, --list-available[=REGEXP] list available packages matching REGEXP
vi: -A, --list-available[=BIỂU-THỨC-CHÍNH-QUY] kiệt kê các gói khớp BTCQ

source: --show=PACKAGE show details about PACKAGE
vi: --show=GÓI hiển thị thông tin chi tiết về GÓI

source: ~A: extraneous argument~%
vi: ~A: đối số ngoại lai~%

source: Try "info '(guix) Invoking guix package'" for more information.~%
vi: Thử chạy lệnh "info “(guix) Invoking guix package'" để có thêm thông tin.~%

source: error: while creating directory `~a': ~a~%
vi: lỗi: trong khi tạo thư mục “~a”: ~a~%

source: Please create the `~a' directory, with you as the owner.~%
vi: Hãy tạo thư mục “~a”, với bạn là chủ sở hữu.~%

source: error: directory `~a' is not owned by you~%
vi: lỗi: thư mục “~a” không được sở hữu bởi bạn~%

source: Please change the owner of `~a' to user ~s.~%
vi: Vui lòng đổi chủ sở hữu của “~a” thành ~s.~%

source: cannot switch to generation '~a'~%
vi: không thể chuyển đến thế hệ “~a'~%

source: invalid syntax: ~a~%
vi: cú pháp không hợp lệ: ~a~%

source: nothing to be done~%
vi: không có gì cần làm~%

source: ~a package in profile~%
vi: ~a gói trong hồ sơ~%

source: Generation ~a ~a
vi: Tạo ~a ~a

source: ~a (current)~%
vi: ~a (hiện tại)~%

source: Usage: guix gc [OPTION]... PATHS... Invoke the garbage collector.
vi: Cách dùng: guix gc [TÙY-CHỌN]… ĐƯỜNG-DẪN… Gọi bộ xử lý rác.

source: -C, --collect-garbage[=MIN] collect at least MIN bytes of garbage
vi: -C, --collect-garbage[=TỐI-THIỂU] sưu tập TỐI-THIỂU byte rác

source: -d, --delete attempt to delete PATHS
vi: -d, --delete cố xóa ĐƯỜNG DẪN

source: --list-dead list dead paths
vi: --list-dead liệt kê các đường dẫn đã chết

source: --list-live list live paths
vi: --list-live liệt kê đường dẫn còn sống

source: --references list the references of PATHS
vi: --references liệt kê các tham chiếu của ĐƯỜNG-DẪN

source: -R, --requisites list the requisites of PATHS
vi: -R, --referrers liệt kê các điều kiện cần cho biến PATH

source: --referrers list the referrers of PATHS
vi: --referrers liệt kê các ĐƯỜNG DẪN cho biến PATH

source: invalid amount of storage: ~a~%
vi: số lượng kho chứa không hợp lệ: ~a~%

source: Usage: guix hash [OPTION] FILE Return the cryptographic hash of FILE. Supported formats: 'nix-base32' (default), 'base32', and 'base16' ('hex' and 'hexadecimal' can be used as well).
vi: Cách dùng: guix hash [TÙY-CHỌN] TẬP-TIN Trả về mã băm của TẬP-TIN. Các định dạng được hỗ trợ: “nix-base32” (mặc định), “base32”, và “base16” (“hex” và “hexadecimal” có thể được dùng cũng tốt).

source: -r, --recursive compute the hash on FILE recursively
vi: -r, --recursive tính mã băm trên TẬP-TIN một cách đệ quy

source: unrecognized option: ~a~%
vi: tùy chọn không được thừa nhận: ~a~%

source: wrong number of arguments~%
vi: số lượng đối số không đúng~%

source: Usage: guix pull [OPTION]... Download and deploy the latest version of Guix.
vi: Cách dùng: guix pull [TÙY-CHỌN]… Tải về và khai triển phiên bản mới nhất của Guix.

source: --url=URL download the Guix tarball from URL
vi: --url=URL tải gói Guix từ URL

source: --bootstrap use the bootstrap Guile to build the new Guix
vi: --bootstrap dùng chương trình mồi Guile để biên dịch Guix

source: tarball did not produce a single source directory
vi: kho tar không sản sinh ra một thư mục mã nguồn đơn

source: unpacking '~a'...~%
vi: đang giải nén “~a”…~%

source: failed to unpack source code
vi: gặp lỗi khi giải gói mã nguồn

source: updated ~a successfully deployed under `~a'~%
vi: đã cập nhật ~a thành công được triển khai dưới “~a'~%

source: failed to update Guix, check the build log~%
vi: gặp lỗi khi cập nhật Guix, hãy kiểm tra nhật ký biên dịch~%

source: Guix already up to date
vi: Guix đã cập nhật rồi

source: ~A: unexpected argument~%
vi: ~A: gặp đối số bất thường~%

source: failed to download up-to-date source, exiting
vi: gặp lỗi khi tải về cập nhật mới nhất của mã nguồn, đang thoát

source: authentication and authorization of substitutes disabled!~%
vi: chứng thực và ủy quyền của cái thay thế bị tắt!~%

source: download from '~a' failed: ~a, ~s~%
vi: tải về từ “~a” gặp lỗi: ~a, ~s~%

source: while fetching ~a: server is somewhat slow~%
vi: khi đang lấy ~a: máy chủ hơi chậm một tí~%

source: try `--no-substitutes' if the problem persists~%
vi: dùng “--no-substitutes” nếu vấn đề vẫn không được giải quyết~%

source: updating list of substitutes from '~a'...~%
vi: đang cập nhật danh sách thay thế từ “~a”…~%

source: signature version must be a number: ~s~%
vi: phiên bản chữ ký phải là con số: ~a~%

source: unsupported signature version: ~a~%
vi: phiên bản chữ ký không được hỗ trợ: ~a~%

source: signature is not a valid s-expression: ~s~%
vi: chữ ký không phải là một biểu thức s hợp lệ: ~s~%

source: invalid format of the signature field: ~a~%
vi: định dạng trường chữ ký không hợp lệ: ~a~%

source: invalid signature for '~a'~%
vi: chữ ký không hợp lệ cho “~a'~%

source: hash mismatch for '~a'~%
vi: mã băm không khớp nhau cho “~a'~%

source: '~a' is signed with an unauthorized key~%
vi: “~a” được ký bằng khóa trái phép~%

source: signature on '~a' is corrupt~%
vi: chữ ký trên “~a” bị hỏng~%

source: substitute at '~a' lacks a signature~%
vi: cái thay thế tại “~a” thiếu chữ ký~%

source: Downloading, please wait...~%
vi: Đang tải, vui lòng chờ…~%

source: (Please consider upgrading Guile to get proper progress report.)~%
vi: (Hãy cân nhắc nâng cấp Guile để nhận được báo cáo tiến trình đúng đắn.)~%

source: host name lookup error: ~a~%
vi: lỗi truy vấn tên máy: ~a~%

source: Usage: guix substitute-binary [OPTION]... Internal tool to substitute a pre-built binary to a local build.
vi: Cách dùng: guix substitute-binary [TÙY-CHỌN]… Công cụ nội tại để thay thế nhị phân dịch sẵn thành dịch nội bộ.

source: --query report on the availability of substitutes for the store file names passed on the standard input
vi: --query báo cáo trên tính sẵn sàng của thay thế cho các tên tập-tin lưu trữ được chuyển trên đầu ra tiêu chuẩn

source: --substitute STORE-FILE DESTINATION download STORE-FILE and store it as a Nar in file DESTINATION
vi: --substitute TẬP-TIN-LƯU ĐÍCH tải về TẬP-TIN-LƯU và lưu nó trong tập tin ĐÍCH Nar

source: ACL for archive imports seems to be uninitialized, substitutes may be unavailable
vi: ACL dành cho nhập kho lưu dường như là chưa được khởi tạo, việc thay thế có lẽ là không sẵn sàng

source: these substitute URLs will not be used:~{ ~a~}~%
vi: URL thay thế sẽ không được dùng:~{ ~a~}~%

source: failed to look up host '~a' (~a), substituter disabled~%
vi: gặp lỗi khi tìm máy “~a” (~a), bộ thay thế đã bị tắt~%

source: ~a: unrecognized options~%
vi: ~a: không chấp nhận các tùy chọn~%

source: cannot find public key for secret key '~a'~%
vi: không thể tìm thấy khóa công cho khóa bí mật “~a'~%

source: error: invalid signature: ~a~%
vi: lỗi: chữ ký không hợp lệ: ~a~%

source: error: unauthorized public key: ~a~%
vi: lỗi: khóa công không đúng: ~a~%

source: error: corrupt signature data: ~a~%
vi: lỗi: dữ liệu chữ ký bị hỏng: ~a~%

source: Usage: guix authenticate OPTION... Sign or verify the signature on the given file. This tool is meant to be used internally by 'guix-daemon'.
vi: Cách dùng: guix authenticate TÙY-CHỌN… Ký hoặc xác minh chữ ký trên tập tin đã cho. Công cụ này được dùng nội bộ bởi “guix-daemon”.

source: wrong arguments
vi: các đối số sai

source: failed to open operating system file '~a': ~a~%
vi: gặp lỗi khi mở tập tin hệ điều hành “~a”: ~a~%

source: ~a: error: ~a~%
vi: ~a: lỗi: ~a~%

source: failed to load operating system file '~a':~%
vi: gặp lỗi khi tải tập tin hệ điều hành “~a”:~%

source: failed to register '~a' under '~a'~%
vi: gặp lỗi khi đăng ký “~a” dưới ~a~%

source: failed to install GRUB on device '~a'~%
vi: gặp lỗi khi cài đặt GRUB trên thiết bị “~a'~%

source: initializing the current root file system~%
vi: đang khởi tạo hệ thống tập tin gốc hiện tại~%

source: activating system...~%
vi: đang kích hoạt hệ thống…~%

source: unrecognized boot parameters for '~a'~%
vi: tham số khởi động không được thừa nhận cho “~a'~%

source: initializing operating system under '~a'...~%
vi: đang khởi tạo hệ điều hành dưới “~a”…~%

source: Usage: guix system [OPTION] ACTION FILE Build the operating system declared in FILE according to ACTION.
vi: Cách dùng: guix system [TÙY-CHỌN] THAO-TÁC TẬP-TIN biên dịch hệ điều hành khai báo trong TẬP-TIN tuân theo THAO-TÁC.

source: The valid values for ACTION are:
vi: Các giá trị hợp lệ cho THAO TÁC là:

source: - 'reconfigure', switch to a new operating system configuration
vi: - “reconfigure”, chuyển thành cấu hình hệ điều hành mới

source: - 'build', build the operating system without installing anything
vi: - “build”, biên dịch hệ điều hành mà không cài gì

source: - 'vm', build a virtual machine image that shares the host's store
vi: - “vm”, biên dịch một ảnh máy ảo kiểu mà có thể chia sẻ trên kho máy

source: - 'vm-image', build a freestanding virtual machine image
vi: - “vm-image”, biên dịch một ảnh máy ảo đứng tự do

source: - 'disk-image', build a disk image, suitable for a USB stick
vi: - “disk-image”, biên dịch ảnh đĩa, phù hợp để dùng cho đĩa USB

source: - 'init', initialize a root file system to run GNU.
vi: - “init”, khởi tạo một hệ thống tập tin gốc để chạy GNU.

source: --image-size=SIZE for 'vm-image', produce an image of SIZE
vi: --image-size=CỠ cho “vm-image”, sản sinh ảnh theo CỠ này

source: --no-grub for 'init', do not install GRUB
vi: --no-grub dành cho “init”, đừng cài GRUB

source: --share=SPEC for 'vm', share host file system according to SPEC
vi: --share=SPEC cho “vm”, chia sẻ hệ thống tập tin chủ tuân theo SPEC

source: --expose=SPEC for 'vm', expose host file system according to SPEC
vi: --expose=SPEC cho “vm”, phơi bày hệ thống tập tin chủ tuân theo SPEC

source: --full-boot for 'vm', make a full boot sequence
vi: --full-boot cho “vm”, tạo một chuỗi mồi đầy đủ

source: ~a: unknown action~%
vi: ~a: không hiểu thao tác~%

source: wrong number of arguments for action '~a'~%
vi: sai số lượng đối số cho thao tác “~a'~%

source: no configuration file specified~%
vi: chưa ghi rõ tập tin nhập cấu hình~%

source: Available checkers:~%
vi: Các bộ kiểm định sẵn có:~%

source: description should not be empty
vi: phần mô tả không thể là rỗng

source: description should start with an upper-case letter or digit
vi: phần mô tả nên bắt đầu bằng một chữ HOA hay chữ số

source: sentences in description should be followed ~ by two spaces; possible infraction~p at ~{~a~^, ~}
vi: các câu trong phần mô tả nên theo sau bởi ~ hai dấu cách; có thể phạm luật ~p tại ~{~a~^, ~}

source: pkg-config should probably be a native input
vi: pkg-config nên hầu như chắc chắn là đầu vào nguyên bản

source: synopsis should not be empty
vi: tóm lược không thể trống rỗng

source: no period allowed at the end of the synopsis
vi: không có dấu chấm ở cuối phần tóm lược

source: no article allowed at the beginning of the synopsis
vi: không có bài viết tại đầu của tóm lược

source: synopsis should be less than 80 characters long
vi: tóm lược nên ngắn hơn 80 ký tự

source: synopsis should start with an upper-case letter or digit
vi: phần tóm lược nên bắt đầu bằng một chữ HOA hay chữ số

source: synopsis should not start with the package name
vi: phần tóm lược không nên bắt đầu bằng tên gói

source: URI ~a not reachable: ~a (~s)
vi: URI ~a không thể tiếp cận: ~a (~s)

source: URI ~a domain not found: ~a
vi: URI ~a không tìm thấy miền: ~a

source: URI ~a unreachable: ~a
vi: URI ~a không tiếp cận được: ~a

source: invalid value for home page
vi: giá trị của trang chủ không hợp lệ

source: invalid home page URL: ~s
vi: URL trang chủ không hợp lệ: ~s

source: file names of patches should start with the package name
vi: tên tập tin của các miếng vá nên bắt đầu bằng tên của gói

source: ~a: ~a: proposed synopsis: ~s~%
vi: ~a: ~a: tóm lược dự kiến: ~s~%

source: ~a: ~a: proposed description:~% "~a"~%
vi: ~a: ~a: mô tả dự kiến:~% "~a"~%

source: Validate package descriptions
vi: Phê duyệt mô tả gói

source: Validate synopsis & description of GNU packages
vi: Phê duyệt tóm lược và mô tả gói GNU

source: Identify inputs that should be native inputs
vi: Đầu vào định danh cái mà có thể là đầu vào tự nhiên

source: Validate file names of patches
vi: Phê duyệt tên tập tin của bản vá

source: Validate home-page URLs
vi: Phê duyệt các URL trang chủ

source: Validate source URLs
vi: Phê chuẩn các URL

source: Validate package synopses
vi: Phê duyệt phần tóm lược của gói

source: Usage: guix lint [OPTION]... [PACKAGE]... Run a set of checkers on the specified package; if none is specified, run the checkers on all packages.
vi: Usage: guix lint [TÙY CHỌN]… [GÓI]… Chạy một nhóm các bộ kiểm định trên gói đã chỉ ra; nếu không chỉ ra cái nào, chạy các bộ kiểm định trên mọi gói.

source: -c, --checkers=CHECKER1,CHECKER2... only run the specificed checkers
vi: -c, --checkers=KIỂM1,KIỂM2… chỉ chạy những bộ kiểm đã cho

source: -l, --list-checkers display the list of available lint checkers
vi: -l, --list-checkers hiển thị danh sách bộ kiểm sẵn có

source: ~a: invalid checker~%
vi: ~a: bộ kiểm tra không hợp lệ~%

source: signature verification failed for `~a'~%
vi: việc xác minh chữ ký cho “~a'~% gặp lỗi

source: (could be because the public key is not in your keyring)~%
vi: (có thể nguyên nhân là do khóa công không có trong chùm chìa khóa của bạn)~%

source: ~a: could not locate source file
vi: ~a: không thể xác định tập tin nguồn

source: ~a: ~a: no `version' field in source; skipping~%
vi: ~a: ~a: không có trường phiên bản “version” trong nguồn; bỏ qua~%

source: failed to install locale: ~a~%
vi: gặp lỗi khi cài đặt miền địa phương: ~a~%

source: Copyright (C) 2014 the Guix authors License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
vi: Bản quyền (C) 2014 thuộc về các tác giả Guix. Giấy phép GPL pb3+: Giấy phép Công cộng GNU phiên bản 3 hay sau <http://gnu.org/licenses/gpl.html> Đây là phần mềm tự do: bạn có quyền sửa đổi và phát hành lại nó. KHÔNG CÓ BẢO HÀNH GÌ CẢ, với điều kiện được pháp luật cho phép.

source: Report bugs to: ~a.
vi: Hãy thông báo lỗi cho ~a. Thông báo lỗi dịch cho: <http://translationproject.org/team/vi.html>.

source: ~a home page: <~a>
vi: ~a trang chủ: <~a>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
vi: Trợ giúp chung về sử dụng phần mềm GNU: <http://www.gnu.org/gethelp/>

source: ~a: invalid number~%
vi: ~a: số không hợp lệ~%

source: invalid number: ~a~%
vi: số không hợp lệ: ~a~%

source: unknown unit: ~a~%
vi: không hiểu đơn vị: ~a~%

source: ~a:~a:~a: package `~a' has an invalid input: ~s~%
vi: ~a:~a:~a: gói “~a” có đầu vào không hợp lệ: ~s~%

source: ~a: ~a: build system `~a' does not support cross builds~%
vi: ~a: ~a: hệ thống dịch “~a” không hỗ trợ dịch chéo~%

source: profile '~a' does not exist~%
vi: hồ sơ “~a” không tồn tại~%

source: generation ~a of profile '~a' does not exist~%
vi: thế hệ “~a” của hồ sơ “~a” không tồn tại~%

source: failed to connect to `~a': ~a~%
vi: gặp lỗi khi kết nối đến “~a”: ~a~%

source: build failed: ~a~%
vi: biên dịch gặp lỗi: ~a~%

source: reference to invalid output '~a' of derivation '~a'~%
vi: tham chiếu đến đầu ra không hợp lệ “~a” của dẫn suất “~a'~%

source: failed to read expression ~s: ~s~%
vi: gặp lỗi khi đọc biểu thức ~s: ~s~%

source: failed to evaluate expression `~a': ~s~%
vi: gặp lỗi khi định giá biểu thức “~a”: ~s~%

source: expression ~s does not evaluate to a package~%
vi: biểu thức “~s” không được định giá cho gói~%

source: ~:[The following derivation would be built:~%~{ ~a~%~}~;~]
vi: ~:[Nguồn sau đây nên được được biên dịch:~%~{ ~a~%~}~;~]

source: ~:[The following file would be downloaded:~%~{ ~a~%~}~;~]
vi: ~:[Tập tin sau đây nên được tải về:~%~{ ~a~%~}~;~]
