Repository: pacoon/guix
Catalog: po/guix/*.po
Languages: vi

source: ~:[The following derivation will be built:~%~{ ~a~%~}~;~]
vi: ~:[Nguồn sau đây sẽ được biên dịch:~%~{ ~a~%~}~;~]

source: ~:[The following file will be downloaded:~%~{ ~a~%~}~;~]
vi: ~:[Những tập tin sau đây sẽ được tải về:~%~{ ~a~%~}~;~]

source: The following package would be removed:~%~{~a~%~}~%
vi: Gói sau đây sẽ nên bị gỡ bỏ:~%~{~a~%~}~%

source: The following package will be removed:~%~{~a~%~}~%
vi: Gói sau đây sẽ bị gỡ bỏ:~%~{~a~%~}~%

source: The following package would be upgraded:~%~{~a~%~}~%
vi: Gói sau đây nên được nâng cấp:~%~{~a~%~}~%

source: The following package will be upgraded:~%~{~a~%~}~%
vi: Gói sau đây sẽ được nâng cấp:~%~{~a~%~}~%

source: The following package would be installed:~%~{~a~%~}~%
vi: Gói sau đây nên được cài đặt:~%~{~a~%~}~%

source: The following package will be installed:~%~{~a~%~}~%
vi: Gói sau đây sẽ được cài đặt:~%~{~a~%~}~%

source: <unknown location>
vi: <không hiểu vị trí>

source: failed to create configuration directory `~a': ~a~%
vi: gặp lỗi khi tạo thư mục cấu hình “~a”: ~a~%

source: unknown
vi: không hiểu

source: invalid argument: ~a~%
vi: đối số không hợp lệ: ~a~%

source: Try `guix --help' for more information.~%
vi: Chạy lệnh “guix --help” để biết thêm thông tin.~%

source: Usage: guix COMMAND ARGS... Run COMMAND with ARGS.
vi: Cách dùng: guix LỆNH ĐỐI_SỐ… Chạy LỆNH với các ĐỐI SỐ.

source: COMMAND must be one of the sub-commands listed below:
vi: LỆNH phải là một trong số những câu lệnh con được liệt kê dưới đây:

source: guix: ~a: command not found~%
vi: guix: ~a: không tìm thấy lệnh~%

source: guix: missing command name~%
vi: guix: thiếu tên lệnh~%

source: guix: unrecognized option '~a'~%
vi: guix: tùy chọn không được thừa nhận “~a'~%

source: using Guile ~a, which does not support ~s encoding~%
vi: đang dùng Guile ~a, mà nó lại không hỗ trợ ~s bộ mã~%

source: download failed; use a newer Guile~%
vi: tải về gặp lỗi; dùng Guile mới hơn~%

source: following redirection to `~a'...~%
vi: đang cho chuyển hướng sang “~a”…~%

source: download failed
vi: tải về gặp lỗi

source: signature is not a valid s-expression
vi: chữ ký không phải là một biểu thức s hợp lệ

source: invalid signature
vi: chữ ký sai

source: invalid hash
vi: giá trị băm sai

source: unauthorized public key
vi: khóa công trái phép

source: corrupt signature data
vi: dữ liệu chữ ký bị hỏng

source: corrupt file set archive
vi: tập hợp tập tin trong kho lưu bị hỏng

source: importing file or directory '~a'...~%
vi: đang nhập tập tin hay thư mục “~a”…~%

source: found valid signature for '~a'~%
vi: tìm thấy chữ ký cho “~a'~% không hợp lệ

source: imported file lacks a signature
vi: tập tin đã nhập vào thiết chữ ký

source: invalid inter-file archive mark
vi: dấu kết-thúc-tập-tin kho lưu không hợp lệ
